       IDENTIFICATION DIVISION.                                         
       PROGRAM-ID. HELLOWLD. 
                                                                                                          
       PROCEDURE DIVISION.                                                                                                        
           DISPLAY 'HELLO, COBOL WORLD!'                                       
           STOP RUN
           .                                                                                               