       01  employee-record             typedef.
           05  employee-name.
               10  first-name          pic X(20) value spaces.
               10  last-name           pic X(20) value spaces.
           05  employee-salary         pic 9(7)V9(2) value zeroes.