       working-storage section.
       01  my-variable pic X(20) value "Hello, COBOL World!".

       procedure division.
           display my-variable
           stop run
           .