       01  name-string     pic X(30) typedef.
       
       01  ranged-size     typedef.
           05  min         pic 9(3)V9.
           05  max         pic 9(3)V9.